### Terraform plan for prod
#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
data.azurerm_client_config.current: Reading...
azurerm_resource_group.default: Refreshing state... [id=/subscriptions/c57c2a02-297d-4f68-979b-1960df722627/resourceGroups/onlinestore-prod-rg]
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD01Mjc2MDI3Zi02MWZiLTRmNmEtYTJiYi1iZjI5NTkyOGVjYjk7b2JqZWN0SWQ9ZTRkNTVmOGUtZDBlMC00NjMxLTkxOWUtZjczMWNmMjIyYmVhO3N1YnNjcmlwdGlvbklkPWM1N2MyYTAyLTI5N2QtNGY2OC05NzliLTE5NjBkZjcyMjYyNzt0ZW5hbnRJZD1lNjdjMTU4OS00NzQ3LTRiNzMtYjdiYi1kYTFiNTY3ZWUxZjU=]
azurerm_service_plan.windows: Refreshing state... [id=/subscriptions/c57c2a02-297d-4f68-979b-1960df722627/resourceGroups/onlinestore-prod-rg/providers/Microsoft.Web/serverfarms/onlinestore-plan-windows]
azurerm_windows_web_app.api: Refreshing state... [id=/subscriptions/c57c2a02-297d-4f68-979b-1960df722627/resourceGroups/onlinestore-prod-rg/providers/Microsoft.Web/sites/os-onlinestore-prod-api]
azurerm_windows_web_app.website: Refreshing state... [id=/subscriptions/c57c2a02-297d-4f68-979b-1960df722627/resourceGroups/onlinestore-prod-rg/providers/Microsoft.Web/sites/os-onlinestore-prod-website]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # azurerm_service_plan.linux will be created
  + resource "azurerm_service_plan" "linux" {
      + id                           = (known after apply)
      + kind                         = (known after apply)
      + location                     = "eastus"
      + maximum_elastic_worker_count = (known after apply)
      + name                         = "onlinestore-plan-linux"
      + os_type                      = "Linux"
      + per_site_scaling_enabled     = false
      + reserved                     = (known after apply)
      + resource_group_name          = "onlinestore-prod-rg"
      + sku_name                     = "F1"
      + worker_count                 = (known after apply)
    }

  # azurerm_windows_web_app.api will be updated in-place
  ~ resource "azurerm_windows_web_app" "api" {
        id                                = "/subscriptions/c57c2a02-297d-4f68-979b-1960df722627/resourceGroups/onlinestore-prod-rg/providers/Microsoft.Web/sites/os-onlinestore-prod-api"
        name                              = "os-onlinestore-prod-api"
        tags                              = {}
        # (18 unchanged attributes hidden)

      ~ site_config {
          ~ default_documents                       = [
                "index.html",
              - "hostingstart.html",
            ]
            # (22 unchanged attributes hidden)

          - virtual_application {
              - physical_path = "site\\wwwroot" -> null
              - preload       = false -> null
              - virtual_path  = "/" -> null
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # azurerm_windows_web_app.website will be updated in-place
  ~ resource "azurerm_windows_web_app" "website" {
        id                                = "/subscriptions/c57c2a02-297d-4f68-979b-1960df722627/resourceGroups/onlinestore-prod-rg/providers/Microsoft.Web/sites/os-onlinestore-prod-website"
        name                              = "os-onlinestore-prod-website"
        tags                              = {}
        # (18 unchanged attributes hidden)

      ~ site_config {
          ~ default_documents                       = [
                "index.html",
              - "hostingstart.html",
            ]
            # (22 unchanged attributes hidden)

          - virtual_application {
              - physical_path = "site\\wwwroot" -> null
              - preload       = false -> null
              - virtual_path  = "/" -> null
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

Plan: 1 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @benchiverton, Action: `pull_request`, Working Directory: ``, Workflow: `Plan - prod`*